[
  {
    "_created": "2025-09-13T00:12:01.676Z",
    "title": "THE BIBLICAL CHRISTIAN FAITH",
    "text": "<p>Date: Sun, Jul 27, 2025, 2:55 AM</p><p><br></p><p>INTRODUCTION- ON THE CHRISTIAN FAITH: AS A REVEALED KNOWLEDGE OF GOD NOT RELIGION</p><p><br></p><p>Text:&nbsp;<strong>Galatians 5:1-26-</strong>&nbsp;<em>“[1] Stand fast therefore in the liberty wherewith Christ hath made us free, and be not entangled again with the yoke of bondage.[2] Behold, I Paul say unto you, that if ye be circumcised, Christ shall profit you nothing.[3] For I testify again to every man that is circumcised, that he is a debtor to do the whole law.[4] Christ is become of no effect unto you, whosoever of you are justified by the law; ye are fallen from grace.[5] For we</em></p><p><br></p><p><em>through the Spirit wait for the hope of righteousness by faith.[6] For in Jesus Christ neither circumcision availeth anything, nor uncircumcision; but faith which worketh by love.[7] Ye did run well; who did hinder you that ye should not obey the truth?[8] This persuasion cometh not of him that calleth you.[9] A</em></p><p><br></p><p><em>little leaven leaveneth the whole lump.[10] I have confidence in you through the Lord, that ye will be none otherwise minded: but he that troubleth you shall bear his judgment, whosoever he be.[11] And I, brethren, if I yet preach circumcision, why do I yet suffer persecution? then is the offence of the cross ceased.[12] I would they were even cut off which trouble you.[13] For, brethren, ye have been called unto liberty; only use not liberty for an occasion to the flesh, but by love serve one another.[14] For all the law is fulfilled in one word, even in this; Thou shalt love thy neighbour as thyself.[15] But if ye bite and devour one another, take heed that ye be not consumed one of another.[16] This I say then, Walk in the Spirit, and ye shall not fulfill the lust of the flesh.[17] For the flesh lusteth against the Spirit, and the Spirit against the flesh: and these are contrary the one to the other: so that ye cannot do the things that ye would.[18] But if ye be led of the Spirit, ye are not under the law.[19] Now the works of the flesh are manifest, which are these; Adultery, fornication, uncleanness, lasciviousness,[20] Idolatry, witchcraft, hatred, variance, emulations, wrath, strife, seditions, heresies,[21] Envyings, murders, drunkenness, revellings, and such like: of the which I tell you before, as I have also told you in time past, that they which do such things shall not inherit the kingdom of God.[22] But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith,[23] Meekness, temperance: against such there is no law.[24] And they that are Christ’s have crucified the flesh with the affections and lusts.[25] If we live in the Spirit, let us also walk in the Spirit.[26] Let us not be desirous of vain glory, provoking one another, envying one another.”</em>&nbsp;______________________________________________________</p><p><br></p><p>The protestant&nbsp;<strong>Bernard Ramm</strong>&nbsp;in his&nbsp;<strong>Protestant Christian Evidences&nbsp;</strong>wrote in his introduction that: “Christian theology assumes the truthfulness of the Christian religion. It is the function of Christian apologetics to show that this assumption is defensible. It is the function of Christian theology to construct the</p><p><br></p><p>Christian system , it is the function of Christian apologetics to verify it. Sometimes it is called Christian theism or philosophical theology or philosophy of religion. However apologetics be labeled its function is still clear, namely, to show that Christianity is the true religion.” The view of Protestant theologian, Bernard Ramm is purely human wisdom not sound in doctrine based on the holy Scriptures.</p><p><br></p><p><strong>First,</strong>&nbsp;Christ did not establish and start a new religion but proclaim Himself as “I am the way, the truth, and the life: no man cometh unto the Father, but by me.”<strong>&nbsp;John 14:6</strong>&nbsp;He was the enemy of established religion during His times and to all times when He told people this bold declarations:” Come unto me, all ye that labour and are heavy laden, and I will give you rest.Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls. for my yoke is easy, and my burden is light.” Matthew 11:28-29 “I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live: And whosoever liveth and believeth in me shall never die. Believest thou this?” John 11:25-26 “All power is given unto me in heaven and in earth. Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost: Teaching them to observe all things whatsoever I have commanded you: and lo, I am with you alway, even unto the end of the world.”&nbsp;<strong>Matthew 28:18-20</strong></p><p><br></p><p><strong>Second,</strong>&nbsp;religion is not the foundation to be engaged with concerning spiritual things because this only gives false hope as noted in the Scriptures. It is always an exacting reminder to all who are seeking the truth of what the Lord told His disciples: ” ….If ye continue in my word, then are ye my disciples indeed; And ye shall know the truth, and the truth shall make you free.” John 8:31-32</p><p><br></p><p><br></p><p><br></p><p><strong>Third</strong>, the supreme authority in the realm of the Christian faith in doctrine and practice is not religion but solely the Scriptures. Nothing more and nothing less. It was the Lord who said: “He that is of God heareth God’s words: ye therefore hear them not, because ye are not of God.” John 8:47 “Search the scriptures; for in them ye think ye have eternal life: and they are they which testify of me.” John 5:39 “Is it not written in your law, I said, ye are gods? If he called them gods, unto whom the word of God came, and the scripture cannot be broke; say ye of him, whom the Father hath sanctified, and sent into the world, Thou blasphemest; because I said, I am the Son of God? If I do not the works of my Father, believe me not. But if I do, though ye believe not me, believe the works: that ye may know, and believe, that the Father is in me, and I in him.” John 10:34-38</p><p><br></p><p><strong>Religion&nbsp;</strong>is a system of beliefs concerning God but based on man’s traditions which actually are expressions of the wisdom of men in this world. However, religion could be man’s rationalization based on divine revelation and man’s</p><p><br></p><p>intellectualism through philosophical arguments and sheer persuasions This is the sentiment and rationalization of&nbsp;<strong>Bernard Ramm, in his Protestant Christian Evidences.&nbsp;</strong>When he wrote his observations on the Christian religion as truthful because of Christian evidences,Ramm is not in line with the bold declarations of the Lord Jesus Christ against established religion.&nbsp;<em>“If it can be demonstrated that Christianity is a religion that actually obtains in the universe by showing its factuality, we have also proved its truthfulness. This is not the total evidence of Christianity, but that it is indispensable cannot be controverted. Religious liberalism has no real doctrine of Christian evidences. The reason is not far to seek. In that it makes religion essentially the function of man’s religious nature-after Schleirmacher, Ritschl, Troeltsch, and Harnack-it has no need for the supernatural nor for the relevance of religion to concrete fact. But religious liberalism, tends to be a system of religious belief based essentially upon a philosophy or psychology or history of religion, but not on the Christian religion by means of Christian evidences has gone a long way proving the truthfulness of the Christian religion, and in a manner and method religious liberalism can offer no valid parallel.”</em></p><p><br></p><p>The human intellectualism of religion whether fundamental or liberal as noted in Christian evidences in Ramm’s viewpoint can not establish the truth; because truth in the Christian faith as revealed by God in the holy Scriptures is the truth of the grace of Christ which is the gospel of God. The apostles did not establish religion: they were proclaiming purely the gospel of God in Christ, and at the same time teaching all that they learned from the Lord. This is beyond improvement by human prowess but to claim by faith that this is the absolute truth through simple reasoning. The Lord says in<strong>&nbsp;Isaiah 1:18</strong>–“Come now, and let us reason together, saith the Lord: though your sins be as scarlet, they shall be white as snow; though they be red like crimson, they shall be as</p><p><br></p><p>wool.”&nbsp;<strong>Galatians 1: 6-12</strong>&nbsp;makes this evident as truth of the Christian faith based on God’s divine revelation:&nbsp;<em>“[6] I marvel that ye are so soon removed from him that called you into the grace of Christ unto another gospel:[7] Which is not another; but there be some that trouble you, and would pervert the gospel of Christ.[8] But though we, or an angel from heaven, preach any other gospel unto you than that which we have preached unto you, let him be accursed.[9] As we said before, so say I now again, If any man preach any other gospel unto you than that ye have received, let him be accursed.[10] For do I now persuade men, or God? or do I seek to please men? for if I yet pleased men, I should not be the servant of Christ.[11] But I certify you, brethren, that the gospel which was preached of me is not after man.[12] For I neither received it of man, neith</em>er was I taught it, but by the revelation of Jesus Christ.”</p><p><br></p><p>The truth of the gospel of God in Christ is already established by divine revelation through the Holy Spirit and His words, the revealed truth, in<strong>&nbsp;John 8:31-32</strong>&nbsp;: “If ye continue in my word, then are ye my disciples indeed; And ye shall know the truth, and the truth shall make you free.” This is the gist and summarized foundation of the Christian faith; truly not based on philosophy of religion- on human rationalizations and intellectualism. The absolute truth in the Scriptures as divine revelation can never be improved by human wisdom but corrupted by human intellectualism and pretensions. God says in His word- “For my thoughts are not your thoughts, neither are your ways, saith the Lord. For as the heavens are higher than the earth, so are my ways higher tan your ways, and my thoughts than your thoughts. For as the rain cometh down, and the snow from heaven, and returneth not thither, but watereth from the earth, and maketh it bring forth and bud, that it may give seed to the sower, and bread to the eater: So shall my word be that goeth forth out of my mouth: it shall not return unto me void, but it shall accomplish that which I please, and it shall prosper in the thing I sent it.”<strong>&nbsp;ISAIAH 55:8-11</strong></p><p><br></p><p>The Christian faith as taught in the Holy Bible is not religion as systematized and rationalized beliefs based on human rationality and sheer human prowess made by</p><p><br></p><p>theologians, Christian philosophers and apologists. It revolves on a divine Person of the Son of God , the Lord Jesus Christ and His divine teachings that magnetize the heart, mind and soul of depraved sinners: to deliverance from the bondage and power of sin in this darkened world of wickedness and iniquity. As a result of this supernatural and beyond normal knowledge, the light of this supernatural and divine wisdom gives light of the knowledge of the glory of God in the face of Jesus Christ. The apostle Paul made this very clear and pointed truth: “But have renounced the hidden things of dishonesty, not walking in</p><p><br></p><p>craftiness, nor handling the word of God deceitfully; but by manifestation of the truth commending ourselves to every man’s conscience in the sight of God.But if our gospel be hid, it is hid to them that are lost: In whom the god of this world hath blinded the minds of them which believe not , lest the light of the glorious gospel of Christ, who is the image of God , should shine unto them.”&nbsp;<strong>2 Corinthians 4:2-4</strong></p><p><br></p><p>Knowing Christ is knowledge of the truth acquired by the God-given innate reasoning power through understanding Jesus Christ of the divine revelation of the Holy Scripture by the power of the Holy Spirit. Apart from divine revelation through the Scripture there is no true knowledge of the truth of God in Christ.</p><p><br></p><p>WHAT THEN IS THE CHRISTIAN FAITH? The exemplary life of the great Apostle Paul is the Christian faith in action till the consummation of his earthly existence. Before his dynamic and powerful conversion on the road to Damascus, he was a rabid and zealot adherent to the traditions of his fathers- the Jewish religion- specifically the sect of the Pharisees.</p><p><br></p><p>This was his testimony to the churches in Galatia as revealed in his passionate letter.&nbsp;<em>“…For ye have heard of my conversation in time past in the Jews’ religion, how that beyond measure I persecuted the church of God, and wasted it. And profited in the Jews’ religion above many my equals in mine own nation, being more exceedingly zealous of the traditions of my fathers…”</em><strong>&nbsp;Galatians 1:13-14</strong></p><p><br></p><p>Nevertheless, God separated him by grace to preach the Lord Jesus Christ to the heathen according to the apostle Paul. By this he meant his personal and life-changing encounter with the risen Christ, which radically changed him overnight in physical and spiritual sense. He was terribly shaken and shocked to the core of his being that he fell to the ground and later on had the physical</p><p><br></p><p>blindness because&nbsp;<em>“…I could not see for the glory of that light, being led by the</em></p><p><em>hand of them that were with me, I came into Damascus.”</em>&nbsp;<strong>Acts 22:11&nbsp;</strong>No doubt about it Paul’s life from the start of his commission until martyrdom the passion and zeal of his faith in the person of Christ was beyond question. He lived and preached “the faith which once he destroyed. And they glorified God in me.”&nbsp;<strong>Galatians 1: 23-24</strong></p><p><br></p><p>THE CHRISTIAN FAITH AS REVEALED KNOWLEDGE FROM GOD NOT FROM THE BY-PRODUCT OF HUMAN WISDOM - HAS SEVEN DISTINCTIVE MARKS ACCORDING TO SCRIPTURE SPECIFICALLY IN&nbsp;<strong>GALATIANS 5</strong>:</p><p><br></p><p><br></p><ol><li><strong>It is a walk in the grace of Christ as the preached gospel received by faith and empowered by the HOLY SPIRIT</strong>.<strong>&nbsp;5:4</strong>&nbsp;“Christ is become of no effect unto you, whosoever of you are justified by the law, ye are fallen from grace.” The great apostle Paul was very deeply entrenched in his religion of his forefathers: Judaism specifically the sect of the Pharisees. He wrote his passion as a religious bigot and fanatic in his testimony to the churches in Galatia-“For ye have heard of my conversation in time past in the Jews’ religion , how that beyond measure I persecuted the church of God, and wasted it: And profited in the Jews’ religion above many my equals in mine own nation, being more exceedingly zealous of the traditions of my fathers.”&nbsp;<strong>Galatians 1: 13-14</strong>&nbsp;Nevertheless, the power of the risen Christ overwhelmed him with that supernatural power of divine revelation given unto him that radically changed him overnight, even to the extent of yielding and asking the Lord: “What shall I do Lord?”<strong>&nbsp;Acts 22:10; Acts 26: 15-18&nbsp;</strong>The apostle Paul was captivated by the power of the risen Christ to surrender his life with passion and devotion for the gospel of the grace of Christ that he received and experienced on the way to Damascus encounter. Thus, Paul was very strong in his language in writing the churches in Galatia to correct the false teachings of the religion of the Judaism-</li><li><br></li><li>those preaching the gospel of Christ plus the law of circumcision in the TORAH. The grace of Christ is the pure gospel and can not be perverted by any means except that those teachers and followers be accursed from the wrath of God! “[6] I marvel that ye are so soon removed from him that called you into the grace of Christ unto another gospel:[7] Which is not another; but there be some that trouble you, and would pervert the gospel of Christ.[8] But though we, or an angel from heaven, preach any other gospel unto you than that which we have preached unto you, let him be accursed.[9] As we said before, so say I now again, If any man preach any other gospel unto you than that ye have received, let him be accursed.”<strong>&nbsp;Galatians 1: 6-9&nbsp;</strong>Paul was very pointed and emphatic with firmness and resolved to condemn those who are circumcised to be justified by the law as fallen from grace- literally cut off from the grace of our Lord Jesus Christ.“For I testify again to every one that is circumcised, that he is a debtor to do the whole law . Christ is become of no effect unto you, whosoever of you are justified by the law; ye fallen from grace.”&nbsp;<strong>Galatians 5:3-4</strong></li></ol><p><br></p><p><br></p><ol><li><strong>2. It is the walk in the liberty of Christ by the Spirit of Christ in the life of faith. 5:1</strong>&nbsp;<em>” Stand fast therefore in the liberty wherewith Christ hath made us free, and be not entangled again with the yoke of bondage.”&nbsp;</em>The Christian faith is indeed the walk in the liberty of Christ and being freed from the bondage of the law of circumcision.The Spirit of Christ is the spirit of liberty as Paul conviction by divine revelation not his human wisdom.&nbsp;<em>“Now the Lord is that Spirit: and where the Spirit of the Lord is, there is liberty.”</em>&nbsp;<strong>2 Corinthians 3:17</strong>&nbsp;The singularity and exclusiveness of being in Christ with its liberty can not be undermined and ruined by human traditions and human wisdom and intellectualism in any shade because this absolute truth is divine revelation. To Paul this truth is non-negotiable and will never be compromised in any way.</li><li>Liberty in Christ is freedom from untruth, lies, perversions, superstitions, despicable maneuverings from evil men with its malice and deceptions. The Spirit of Christ guides, teaches and leads the true believers to the truth, and even truth will set them free.&nbsp;<strong>John 8:31-32</strong></li><li><strong>It the walk of faith which works by love. 5:6, 13,14</strong>&nbsp;“For in Jesus Christ neither circumcision availeth any thing, nor uncircumcision; but faith which worketh by love…For, brethren, ye have been called unto liberty; only use not liberty for an occasion to the flesh, but by love serve one another. For all the law is fulfilled in one word, even in this; Thou shalt love thy neighbour as thyself. “ The Christian faith is a walk with the zeal to good works in the name of Christ as taught by the Lord. It was the Lord Jesus Christ</li><li>during his earthly ministry who taught the disciples regarding good work done in His name.&nbsp;<em>“For whosoever shall give you a cup of water to drink in my name, because ye belong to Christ , verily I say unto you, he shall not lose his reward.”</em>&nbsp;<strong>Mark 9: 41</strong></li><li>Though salvation is by grace and not based on good works because it is purely by the grace of God through faith according to Paul in&nbsp;<strong>Ephesians 2:8-9</strong>, true believers must understand that God has ordained us to do good works<strong>. Ephesians 2:10</strong>-<em>” For we are his workmanship, created in Christ Jesus unto good works , which God hath before ordained that we should walk in them.”</em></li></ol><p><br></p><p>Again Paul instructed and exhorted the followers of Christ to maintain good works in the life of faith: “This is a faithful sayin, and these things I will that thou affirm constantly, that they which have believed in God might be careful to maintain good works. These things are good and profitable unto men.”&nbsp;<strong>Titus 3:8&nbsp;</strong>Make no mistake that good works done in the Christian faith is not to inflate the ego but to the glory of the Father in Christ.&nbsp;<strong>Colossians 3:17</strong>-” And whatsoever ye do in word or in deed , do all in the name of the Lord Jesus, giving thanks to God and the Father by him.” To love to do good works in His name is to glorify the Father: “Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven.”<strong>&nbsp;Matthew 5:16</strong></p><p><br></p><p><br></p><ol><li><strong>It is the walk of obedience and yielding to the Spirit rather to the lusts of the indwelling flesh.5:16</strong>&nbsp;<em>“This I say then, Walk in the Spirit, and ye shall not fulfil the lust of the flesh.”</em></li><li>When the apostle Paul wrote his powerful treatise on the gospel of God in Christ to the the believers in Rome he pointed out the true faith that leads to obedience otherwise there is none whatsoever about the truth of the gospel. The obedience to the faith confirms that there is genuine Christian faith. No obedience means absolutely emptiness of the profession of faith.&nbsp;<strong>Paul&nbsp;</strong>wrote:&nbsp;<em>“[1] Paul, a servant of Jesus Christ, called to be an apostle, separated unto the gospel of God,[2] (Which he had promised afore by his prophets in the holy scriptures,)[3] Concerning his Son Jesus Christ our Lord, which was made of the seed of David according to the flesh;[4] And declared to be the Son of God with power, according to the spirit of holiness, by the resurrection from the dead:[5] By whom we have received grace and apostleship, for obedience to the faithamong all nations, for his name:[6] Among whom are ye also the called of Jesus Christ:”</em>&nbsp;<strong>Romans 1:1-6</strong></li><li>The Christian faith demands obedience through yielding to the guidance, teachings and leadership of the Holy Spirit as taught by the Lord Jesus Christ to His disciples during His earthly ministry.<strong>&nbsp;John 14-16&nbsp;</strong>The Lord Jesus Christ in one of His teachings told the disciples:&nbsp;<em>” And why call ye me, Lord, Lord, and do not the things I say? Whosoever cometh to me, and heareth my sayings, and doeth them, I will shew you to whom he is like: He is like a man which built an house, and digged deep, and laid the foundation on a rock: and when the flood arose, the stream beat vehemently upon that house, and could not shake it: for it was founded upon a rock.But he that heareth, and doeth not, is like a man that without a foundation built an house upon the earth; against which the stream did beat vehemently and immediately it fell; and the ruin of that house was great.”</em><strong><em>&nbsp;</em>Luke 6:46-49</strong>&nbsp;The apostle Paul wrote also in the same vein concerning obedience and yielding to the Holy Spirit in<strong>&nbsp;Romans 6: 17-23–</strong>“[17] But God be thanked, that ye were the servants of sin, but ye have obeyed from the heart that form of doctrine which was delivered you.[18] Being then made free from sin, ye became the servants of righteousness.[19] I speak after the manner of men because of the infirmity of your flesh: for as ye have yielded your members servants to uncleanness and to iniquity unto iniquity; even so now yield your members servants to righteousness unto holiness.[20] For when ye were the servants of sin, ye were free from righteousness.[21] What fruit had ye then in those things whereof ye are now ashamed? for the end of those things is death.[22] But now being made free from sin, and become servants to God, ye have your fruit unto holiness, and the end everlasting life.[23] For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.”</li><li><strong>It is the walk under the leadership of the Holy Spirit. 5: 18&nbsp;</strong><em>“But if ye be led of the Spirit, ye are not under the law.”</em></li></ol><p>Walking in the Christian faith is walking under the leadership and guidance of the Holy Spirit. There is no leadership in the Christian life but the Holy Spirit. He is our Counselor, Comforter, Teacher, Guide, Prompter, the Recall Power of God in everything that is absolutely necessary to do the will of God. He is the successor of Christ on earth after all the Holy Spirit is the Spirit of grace of Christ.<strong>&nbsp;Hebrews 10:29</strong></p><p><br></p><p>It is impossible to live the Christian faith in action without acknowledging and be truly dependent on the Holy Spirit.Not to submit to the leadership of the Holy Spirit is definitely living in the flesh and in subjection to its affections and lusts. This is condemned by God and is an affront and rebellion to God. Paul says, ” For they that are after the flesh do mind the things of the flesh; but they that are after the Spirit the things of the Spirit. For to be carnally minded is death; but to be spiritually minded is life and peace.Because the carnal mind is enmity against God: for it is not subject to the law of God, neither indeed can be. So then they that are in the flesh cannot please God.”&nbsp;<strong>Romans 8: 5-8&nbsp;</strong>When the Holy Spirit is leader in the Christian life the flesh is definitely crucified and denied for the Spirits is contrary to the Spirit of God. Walking under the leadership of the Spirit of Christ is walking after righteousness, holiness, and godliness.&nbsp;<strong>Romans 6:19-22–</strong>&nbsp;“[19] I speak after the manner of men because of the infirmity of your flesh: for as ye have yielded your members servants to uncleanness and to iniquity unto iniquity; even so now yield your members servants to righteousness unto holiness.[20] For when ye were the servants of sin, ye were free from righteousness.[21] What fruit had ye then in those things whereof ye are now ashamed? for the end of those things is death.[22] But now being made free from sin, and become servants to God, ye have your fruit unto holiness, and the end everlasting life.[23] For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.”</p><p><br></p><p><br></p><ol><li><strong>6. It is the walk that is focused on the bearing of the fruit of the Holy Spirit.5: 22-23</strong>&nbsp;<em>” But the fruit of the Spirit is love, joy, peace, long-suffering, gentleness, goodness, faith, Meekness,temperance; against such there is no law.”</em></li><li>The Christian faith is true because of the evident fruit of the Holy Spirit that can be experienced and manifested in the lives of true believers. There is the new</li><li>creation in Christ by the power of the Spirit who brings changes in the lives of men through the bearing the fruit of God’s power- by the ministry of the Holy Spirit. Religion has no power to create the new person in Christ but emptiness in life- no love, no joy, no peace, no long-suffering, no gentleness, no goodness no faith, no meekness, no temperance . Self -transformation can</li><li>not mimic the radical creation in Christ by God’s exceeding power but miserable state of the wicked and corrupt heart.Man’s wisdom in its highest attainment can never overhaul , transform, nd regenerate the wicked heart of men. Only the Spirit of Christ has the supernatural power to make new creatures in Christ among the unconverted and the lost to bear the fruit of the Holy Spirit. ” For in Christ Jesus neither circumcision availeth any thing, nor uncircumcision, but a new creature.”<strong>&nbsp;Galatians 6:15</strong></li></ol><p><br></p><p><br></p><ol><li><strong>7. It is living in the Spirit by crucifying the flesh and its lusts. 5: 24</strong>&nbsp;<em>“And they that are Christ’s have crucified the flesh with the affections and lusts.”</em></li><li>The Christian faith is truly the acknowledgment and awareness that the power of living for Christ is under the exceeding control and energy of the Holy Spirit.</li><li>There is no exceeding power in the Christian faith but the Holy Spirit in Christ.&nbsp;<em>“[14] For this cause I bow my knees unto the Father of our Lord Jesus Christ,[15] Of whom the whole family in heaven and earth is named,[16] That he would grant you, according to the riches of his glory, to be strengthened with might by his Spirit in the inner man;[17] That Christ may dwell in your hearts by faith; that ye, being rooted and grounded in love,[18] May be able to comprehend with all saints what is the breadth, and length, and depth, and height;[19] And to know the love of Christ, which passeth knowledge, that ye might be filled with all the fulness of God.[20] Now unto him that is able to do exceeding abundantly above all that we ask or think, according to the power</em></li><li><br></li><li><em>that worketh in us,[21] Unto him be glory in the church by Christ Jesus throughout all ages, world without end. Amen.”</em>&nbsp;<strong>Ephesians 3:14-21</strong></li><li>It is by the power of the Holy Spirit working in and through the believers that affections and lusts of the flesh being contrary to God are being crucified and hindered to operate thus victory is made. How does the Holy Spirit accomplish this thing? It is through the Holy Spirit convicting power of the sword of the Spirit, which is His word, in the minds and hearts of the true believers.<strong>&nbsp;Romans 8:13; Ephesians 6: 17&nbsp;</strong>The quickening power of the Holy Spirit through His words becomes the basis of the believers’ power to walk in the Spirit to overcome the powers of the indwelling flesh.&nbsp;<strong>Psalm 119: 25,28,41; Romans 8: 11,13</strong>&nbsp;” My soul cleaveth unto the dust: quicken thou me according to thy word…My soul melteth for heaviness: strengthen thou me according unto thy word…Let thy mercies come also unto me, O LORD, even thy salvation , according to thy word.”<strong>&nbsp;Psalm 119: 25,28,41</strong></li></ol><p>“[11] But if the Spirit of him that raised up Jesus from the dead dwell in you, he that raised up Christ from the dead shall also quicken your mortal bodies by his Spirit that dwelleth in you.[12] Therefore, brethren, we are debtors, not to the flesh, to live after the flesh. [13] For if ye live after the flesh, ye shall die: but if ye through the Spirit do mortify the deeds of the body, ye shall live.”<strong>&nbsp;Romans 8:11-13</strong></p><p><br></p><p><strong>In conclusion, the Christian faith and religion are not the same or identical; they are far apart in spiritual considerations and perceptions in the things of the Lord and in His Scripture.&nbsp;</strong>The Christian faith is truth while religion in any form is man-made wisdom, and therefore of the flesh. Religion then is vain worship and is therefore spiritually dangerous that leads to eternal condemnation and destruction. The Lord Jesus Christ says in a sobering warning and rebuke to the scribes and Pharisees: ” Ye hypocrites, well did Esaias prophesy of you, saying, This people draweth nigh unto me with their mouth, and honoureth me with their lips; but their heart is far from me. But in vain they do worship me teaching for doctrines the commandments of men.”&nbsp;<strong>Matthew 15:7-9</strong>&nbsp;Paul’s sober and serious warning on this matter is worth heeding: ” Beware lest any spoil you through philosophy and vain deceit, after the tradition of men, after the rudiments of the world, and not after Christ.”&nbsp;<strong>Colossians 2:8</strong></p><p><br></p><p><br></p>",
    "media": ""
  }
]